package Optimizer;

import java.util.*;

/**
 * HIR设计:
 * ----------------------------------------------------------------------------
 *	Option	| addr		| addr		| addr		| 说明
 * ---------+-----------+-----------+-----------+------------------------------
 *	LABEL	| name		|			|			| 标识当前位置为name
 * ---------+-----------+-----------+-----------+------------------------------
 *	MOV 	| target	| source	|			| 把source的内容复制到target
 * ---------+-----------+-----------+-----------+------------------------------
 *	ADD 	| target	| A			| B			| target = A + B
 * ---------+-----------+-----------+-----------+------------------------------
 *	SUB 	| target	| A			| B			| target = A - B
 * ---------+-----------+-----------+-----------+------------------------------
 *	MUL 	| target	| A			| B			| target = A * B
 * ---------+-----------+-----------+-----------+------------------------------
 *	DIV 	| target	| A			| B			| target = A / B
 * ---------+-----------+-----------+-----------+------------------------------
 *	GREAT	| target	| A			| B			| 如果A大于B, 则target为真
 * ---------+-----------+-----------+-----------+------------------------------
 *	EQUAL	| target	| A			| B			| 如果A等于B, 则target为真
 * ---------+-----------+-----------+-----------+------------------------------
 *	LESS	| target	| A			| B			| 如果A小于B, 则target为真
 * ---------+-----------+-----------+-----------+------------------------------
 *	AND 	| target	| A			| B			| 如果A与B同时不等于0,
 *			|			|			|			| 则target为真
 * ---------+-----------+-----------+-----------+------------------------------
 *	OR  	| target	| A			| B			| 如果A和B任一个不等于0, 
 *			|			|			|			| 则target为真
 * ---------+-----------+-----------+-----------+------------------------------
 *	JMP		| label		|			|			| 无条件跳转到label
 * ---------+-----------+-----------+-----------+------------------------------
 *	RETURN	| result	|			|			| 返回result
 * ---------+-----------+-----------+-----------+------------------------------
 *	IFF		| condition	| label		|			| condition为0时, 跳转到label
 * ---------+-----------+-----------+-----------+------------------------------
 *	RANDOM	| target	| min		|	max		| 产生一个min到max的随机数, 
 *			|			|			|			| 并复制到target
 * ----------------------------------------------------------------------------
 *
 * HIR说明:
 *	1. LABEL: <name> 由Optimizer自动生成
 *	2. addr的计算方式:
 *		a. 数字			==> 立即数
 *		b. 标识符		==> 标识符的地址
 *		c. [标识符]		==> [标识符的内容]
 *
 */
public class HIR {
	private ArrayList<Quadruple> __ir;

	public HIR() {
		__ir = new ArrayList<Quadruple>();
	}

	public HIR(HIR hir) {
		__ir = new ArrayList<Quadruple>(hir.__ir);
	}

	public boolean isEmpty() {
		return __ir.isEmpty();
	}

	public int size() {
		return __ir.size();
	}

	public Quadruple get(int index) {
		return __ir.get(index);
	}

	public Quadruple remove(int index) {
		return __ir.remove(index);
	}

	public void add(Quadruple ir) {
		__ir.add(ir);
	}

	public void addAll(HIR hir) {
		__ir.addAll(hir.__ir);
	}
}
